---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFieldType.RevitLinkType
enum: Autodesk.Revit.DB.ScheduleFieldType
source: html/9888db7d-00d0-4fd7-a1a9-cdd1fb5fce16.htm
---
# Autodesk.Revit.DB.ScheduleFieldType.RevitLinkType

A parameter of the RevitLinkType that an element in a linked
 file belongs to. Currently RVT_LINK_FILE_NAME_WITHOUT_EXT is the only
 supported parameter. Only allowed in schedules that include
 elements from linked files.